FOAMySeesExampleCases/FixedFixedBeam/RunCase/OpenFOAMCase/system/blockMeshDict

        /*--------------------------------*- C++ -*----------------------------------*\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//box     (0.6 0.4 0.1) (0.62 0.6 0.6);

vertices
(
    (0 -0.05 0.00)
    (10 -0.05 0.00) //1 A
    (10 0.05 0.00) //2 A
    (0 0.05 0.00)
    (0 -0.05 2.0)
    (10 -0.05 2.0) //5 A
    (10 0.05 2.0) //6 A
    (0 0.05 2.0)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (240 1 24) simpleGrading (1 4 1)
);

edges
(
);

boundary
(
    sideA
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 4 7 3)
        );
    }
    sideB
    {
        type empty;
        faces
        (
        (1 5 4 0)
        (3 7 6 2)
        );
    }
    			 


    interface
    {
        type wall;
        faces (            
            (0 3 2 1)
		);
    }
    atmosphere
    {
        type patch;
        faces (            
            (4 5 6 7)
		);
    }
    defaultFaces
        {
        type patch;
        faces (            
            
		);
    }
);

// ************************************************************************* //
        