FOAMySeesExampleCases/FixedFixedBeam/RunCase/OpenFOAMCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sideA
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       11256;
    }
    sideB
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11520;
        startFace       11304;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       22824;
    }
    atmosphere
    {
        type            patch;
        nFaces          240;
        startFace       23064;
    }
    defaultFaces
    {
        type            patch;
        nFaces          0;
        startFace       23304;
    }
)

// ************************************************************************* //
