FOAMySeesExampleCases/FixedFixedBeam/RunCase/OpenFOAMCase/system/surfaceFeatureExtractDict

	FoamFile
	{
		version	 2.0;
		format	  ascii;
		class	   dictionary;
		object	  surfaceFeatureExtractDict;
	}
	// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
	interface.stl
	{
		// How to obtain raw features (extractFromFile || extractFromSurface)
		extractionMethod	extractFromSurface;

		extractFromSurfaceCoeffs
		{
			// Mark edges whose adjacent surface normals are at an angle less
			// than includedAngle as features
			// - 0  : selects no edges
			// - 180: selects all edges
			includedAngle   180;
		}

		subsetFeatures
		{
			// Keep nonManifold edges (edges with >2 connected faces)
			nonManifoldEdges	   no;

			// Keep open edges (edges with 1 connected face)
			openEdges	   yes;
		}


		// Write options

			// Write features to obj format for postprocessing
			writeObj				yes;
	}

	// ************************************************************************* //
	